uhnp/src/Documents/РисковоеСобытие/РисковоеСобытие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РисковоеСобытие</name>
  <basedOn>Catalog.Риски</basedOn>
  <registerRecords>AccumulationRegister.ЗатратыНаЛиквидациюРисков</registerRecords>
  <attributes>
    <name>НаименованиеСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Риск</name>
    <type>
      <types>CatalogRef.Риски</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникРиска</name>
    <type>
      <types>CatalogRef.ИсточникиРисков</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеИнцидента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрогнозныйУбыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентЗатратНаЛиквидациюРиска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыеЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОснования</name>
    <type>
      <types>CatalogRef.ТипыОснованийРисковыхСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗатрат</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредшествующийИнцидент</name>
    <type>
      <types>DocumentRef.РисковоеСобытие</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноВозможныйУбыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнанныйУбыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цель</name>
    <type>
      <types>CatalogRef.Цели</types>
    </type>
  </attributes>
</mdclass:Document>

uhnp/src/AccumulationRegisters/ЗатратыНаЛиквидациюРисков/ЗатратыНаЛиквидациюРисков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗатратыНаЛиквидациюРисков</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>РисковоеСобытие</name>
    <type>
      <types>DocumentRef.РисковоеСобытие</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Стадия</name>
    <type>
      <types>CatalogRef.СтадииМероприятий</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/Documents/РисковоеСобытие/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Возвращает остаток затрат на устранение рискового события РисковоеСобытиеВход.
Функция ПолучитьОстатокЗатратНаУстранениеРисковогоСобытия(РисковоеСобытиеВход) Экспорт
	РезультатФункции = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗатратыНаЛиквидациюРисковОстатки.РисковоеСобытие КАК РисковоеСобытие,
		|	СУММА(ЗатратыНаЛиквидациюРисковОстатки.СуммаОстаток) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ЗатратыНаЛиквидациюРисков.Остатки(, РисковоеСобытие = &РисковоеСобытие) КАК ЗатратыНаЛиквидациюРисковОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗатратыНаЛиквидациюРисковОстатки.РисковоеСобытие";
	Запрос.УстановитьПараметр("РисковоеСобытие", РисковоеСобытиеВход);
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	РезультатФункции = Выгрузка.Итог("СуммаОстаток");
	Возврат РезультатФункции;
КонецФункции		// ПолучитьОстатокЗатратНаУстранениеРисковогоСобытия()

#Область Печать
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры
#КонецОбласти

#КонецЕсли
